[{"review":"Pero deberia de poder cambiarle el idioma a alexa","author":"WarcryxD","review_source":"iTunes","rating":4,"title":"Excelente","product_name":"Amazon Alexa","reviewed_date":"2018-01-12T02:27:03.000Z"},
{"review":"Cannot fix connection glitches without this-also fix connection glitches \n\nSmart things sees my light and Alexa doesn’t :(\n\n*update new devices “unresponsive” each day...they are working fine in SmartThings. No way to delete disabled devices. Very poor.","author":"Ranchorat","review_source":"iTunes","rating":1,"title":"Need to be able to delete devices","product_name":"Amazon Alexa","reviewed_date":"2017-12-06T13:06:33.000Z"},
{"review":"After typing in the log in screen and submit, jump back to the login screen.","author":"omgzero","review_source":"iTunes","rating":1,"title":"Can’t log it","product_name":"Amazon Alexa","reviewed_date":"2017-12-06T14:48:03.000Z"},
{"review":"I’m new to Alexa and so far I’m pretty impressed.   One thing I am surprised is missing is the ability to play music as part of a routine.  I want to be able to turn on my lights and start some music when I come downstairs each morning with a single command.","author":"ImNorm29","review_source":"iTunes","rating":3,"title":"New user","product_name":"Amazon Alexa","reviewed_date":"2017-12-06T16:30:00.000Z"},
{"review":"There’s no way for me to link iHeart Radio to Alexa. My account was setup via Facebook login \u0026 the app doesn’t give that as an option. Frustrating.","author":"kmryan12","review_source":"iTunes","rating":1,"title":"No login with FB option...","product_name":"Amazon Alexa","reviewed_date":"2017-12-07T00:31:00.000Z"},
{"review":"I would think a huge company would invest as much in the software app as their awesome product. This app does NOTHING that it *could* do with the echo. But I guess when you have foreigners who don't speak English well, in charge of doing the software project, it shows.  \n\nWhy can't it create a simple reminder every day?  Why can't it tell you when someone adds a new item to a list?  My list of shortfalls goes on and on. \n\nIt's Irritating that there are such CRAPPY skills available AND when you go to look at one, you must go back to PAGE 1 and start over through the list. Really?  (Apparently amazon listened and fixed this in 2017 after two years)\n\nCan't believe all the utterly useless apps here and NO WAY to FILTER them. I.e. Why can't I nuke all the crappy apps about INDIA?   Being an American, I should never see India-themed apps if I don't care about anything Indian. \n\nVery poor software from Amazon","author":"bmfb1980","review_source":"iTunes","rating":1,"title":"Needs major work.  Made by teenagers?","product_name":"Amazon Alexa","reviewed_date":"2017-12-07T04:13:12.000Z"},
{"review":"I loved this app but I finally updated after two years and, like the title states, is horrible!","author":"RoguesNtheHouse","review_source":"iTunes","rating":1,"title":"New update is horrible","product_name":"Amazon Alexa","reviewed_date":"2017-12-07T05:16:21.000Z"},
{"review":"It’s really frustrating when I can’t even set up my new Alexa because the app will not let me “allow” permissions. It just freezes on a white screen.","author":"MissCarlyRose","review_source":"iTunes","rating":1,"title":"New update won’t even open or allow me to set up","product_name":"Amazon Alexa","reviewed_date":"2017-12-07T06:06:07.000Z"},
{"review":"It seems as though features disappear. The routines I was able to program a scene from the smart home. Now a can NO LONGER run a scene. The update says a I can remove a device from the smart home yet I can’t remove it only disable it.","author":"kjm1968","review_source":"iTunes","rating":1,"title":"Features disappearing","product_name":"Amazon Alexa","reviewed_date":"2017-12-07T06:17:50.000Z"},
{"review":"Too many bugs. Just doesn’t work","author":"markbruce44","review_source":"iTunes","rating":1,"title":"Terrible","product_name":"Amazon Alexa","reviewed_date":"2017-12-07T20:16:51.000Z"},
{"review":"After about a 2 month hiatus I can’t connect Bc the app is so buggy!!!! \nFix this issue Jeff!!","author":"Tonjarellie","review_source":"iTunes","rating":1,"title":"What happened?","product_name":"Amazon Alexa","reviewed_date":"2017-12-08T00:00:09.000Z"}]